bimarks/app/views/bookmarks/show.html.erb

	<li class="yellowstars" style="width: <%= @bookmark.avg_rating * 25 %>px !important;"></li>
        <li class="text"><%= @bookmark.avg_rating %> average from <%= pluralize(@bookmark.count_ratings, "vote") %></li>
---
SELECT `ratings`.* FROM `ratings` WHERE (`ratings`.bookmark_id = 66)

    <li><%= @bookmark.comments.last.content %></li>
    by: <%= @bookmark.comments.last.user.username %> | <%= time_ago_in_words(@bookmark.comments.last.created_at) %> ago
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1