bimarks/app/controllers/bookmarks_controller.rb

SELECT COUNT(*) FROM `bookmarks`
SELECT `bookmarks`.* FROM `bookmarks` ORDER BY bookmarks.created_at DESC, created_at LIMIT 30 OFFSET 0
---
  def index
    if sort_direction == 'asc'
      @bookmarks = Bookmark.all.sort_by(&:"#{sort_column}").paginate(:page => params[:page], :per_page => 15)

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 18 ORDER BY bookmarks.created_at DESC LIMIT 1
SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`user_id` = 36 AND (`ratings`.bookmark_id = 38) LIMIT 1
---
  def show
	  @bookmark = Bookmark.find(params[:id])
    @comments = @bookmark.comments.paginate(:page => params[:page], :per_page => 5)
	  if signed_in?
	    @new_comment = Comment.new
		  @current_user_rating = @bookmark.ratings.find_by_user_id(current_user.id)

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 23 ORDER BY bookmarks.created_at DESC LIMIT 1
---
  def edit
	  @bookmark = Bookmark.find(params[:id])

INSERT INTO `bookmarks` (`date`, `q_review`, `created_at`, `url`, `user_id`, `title`, `updated_at`) VALUES (NULL, 'nai eimai pao kai pou den paw!', '2011-08-22 22:55:11', 'www.contra.gr', 153, 'Μπαλαδορος', '2011-08-22 22:55:11')
INSERT INTO `ratings` (`updated_at`, `user_id`, `created_at`, `bookmark_id`, `stars`) VALUES ('2011-08-24 21:45:32', 36, '2011-08-24 21:45:32', 50, 5)
---
  def create
	  @bookmark = current_user.bookmarks.build(params[:bookmark])

  	# We create a new rating for this bookmark
  	# and we save it.
  	# We assume that every user submitting a new bookmark
	  # will automatically rate it as a 5 ~ else what's the reason
  	# of submitting it in the first place?
  	@this_rating = @bookmark.ratings.build(params[:rating])
  	@this_rating.bookmark_id = @bookmark
    @this_rating.user = current_user
	  @this_rating.stars = 5
	  @this_rating.save

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 66 AND (`bookmarks`.user_id = 40) ORDER BY bookmarks.created_at DESC LIMIT 1
---
  def update
    @bookmark = Bookmark.find(params[:id])

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 21 AND (`bookmarks`.user_id = 153) ORDER BY bookmarks.created_at DESC LIMIT 1
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 980190962
---
  def destroy
	@bookmark = Bookmark.find(params[:id])
	@bookmark.destroy