bimarks/app/controllers/home_controller.rb

SELECT `bookmarks`.* FROM `bookmarks` ORDER BY bookmarks.created_at DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `bookmarks`
---
  def index
    @bookmarks_most_recent = Bookmark.find(:all, :order => "created_at DESC").first(10)
<<<<<<< HEAD
    @bookmarks_top_rated = Bookmark.all.sort_by(&:avg_rating).reverse.first(10)

    @tag_unique = Tag.all.sort_by(&:count).last(20).shuffle