bimarks/app/controllers/ratings_controller.rb

SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 66 ORDER BY bookmarks.created_at DESC LIMIT 1
INSERT INTO `ratings` (`bookmark_id`, `updated_at`, `stars`, `created_at`, `user_id`) VALUES (66, '2011-08-25 18:45:37', 3, '2011-08-25 18:45:37', 40)
---
def create
	@bookmark = Bookmark.find(params[:bookmark_id])
	@rating = @bookmark.ratings.build(params[:rating])
	@rating.user = current_user

	respond_to do |format|
	if @rating.save

SELECT `ratings`.* FROM `ratings` WHERE `ratings`.`id` = 12 AND (`ratings`.user_id = 36) LIMIT 1
SELECT `bookmarks`.* FROM `bookmarks` WHERE `bookmarks`.`id` = 13 ORDER BY bookmarks.created_at DESC LIMIT 1
UPDATE `ratings` SET `updated_at` = '2011-08-25 02:21:23', `stars` = 4 WHERE `ratings`.`id` = 13
---
def update
	@rating = current_user.ratings.find(params[:id])
	@bookmark = Bookmark.find(params[:bookmark_id])

	respond_to do |format|
	if @rating.update_attributes(params[:rating])