bimarks/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
SELECT COUNT(*) FROM `bookmarks` WHERE (`bookmarks`.user_id = 148)
SELECT `bookmarks`.* FROM `bookmarks` WHERE (`bookmarks`.user_id = 148) ORDER BY bookmarks.created_at DESC
---
   def show
    @user = User.find(params[:id])
    @title = @user.username
    if sort_direction == 'asc'
      @my_bookmarks = @user.bookmarks.sort_by(&:"#{sort_column}").paginate(:page => params[:page], :per_page => 15)

INSERT INTO `users` (`is_admin`, `salt`, `username`, `email`, `updated_at`, `created_at`, `hashed_password`) VALUES (0, 'c665c8c2217b687242c3f43dd15d525ca5939eaf4d771c1341187d909b017772', 'elvira', 'kalargarisbabis@gmail.com', '2011-08-25 15:02:47', '2011-08-25 15:02:47', 'e24c58f9ca3244dd6e4fb90db47b394074d29b71e1db113552b904eceecabe82')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE `users` SET `email` = 'qwe', `username` = 'babisbabis', `password` = '1234', `updated_at` = '2011-08-20 23:20:51' WHERE `users`.`id` = 143
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])